; domain
(define (domain snake)
(:requirements :equality :negative-preconditions)
(:constants
    dummypoint
)
(:predicates
    ;up down left right of a field
    (ISADJACENT ?x ?y)
    ;the last field of the snake
    (tailsnake ?x)
    ;the first field of the snake
    (headsnake ?x)
    ;pieces of the snake that are connected. from front to back
    (nextsnake ?x ?y)
    ;a field that is occupied by the snake or by an obstacle
    (blocked ?x)
    ;next point that will spawn
    (spawn ?x)
    ;point y will spawn after point x
    (NEXTSPAWN ?x ?y)
    ;a field that has a point that can be collected by the snake
    (ispoint ?x)
)
(:action move
    :parameters (?head ?newhead ?tail ?newtail)
    :precondition
    (and
        (headsnake ?head)
        (ISADJACENT ?head ?newhead)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newhead))
        (not (ispoint ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
    )
)

(:action move-and-eat-spawn
    :parameters (?head ?newhead ?spawnpoint ?nextspawnpoint)
    :precondition
    (and
        (headsnake ?head)
        (ISADJACENT ?head ?newhead)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (spawn ?spawnpoint)
        (NEXTSPAWN ?spawnpoint ?nextspawnpoint)
        (not (= ?spawnpoint dummypoint))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (ispoint ?spawnpoint)
        (not (spawn ?spawnpoint))
        (spawn ?nextspawnpoint)
    )
)

(:action move-and-eat-no-spawn
    :parameters (?head ?newhead)
    :precondition
    (and
        (headsnake ?head)
        (ISADJACENT ?head ?newhead)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (spawn dummypoint)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
    )
)

)

; problem
(define (problem snake-empty-3x5-1-5-2-158)
(:domain snake)
(:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos0-4 pos1-0 pos1-1 pos1-2 pos1-3 pos1-4 pos2-0 pos2-1 pos2-2 pos2-3 pos2-4
)
(:init
    (isAdjacent pos0-0 pos1-0)
 (isAdjacent pos0-0 pos0-1)
 (isAdjacent pos0-1 pos1-1)
 (isAdjacent pos0-1 pos0-2)
 (isAdjacent pos0-1 pos0-0)
 (isAdjacent pos0-2 pos1-2)
 (isAdjacent pos0-2 pos0-3)
 (isAdjacent pos0-2 pos0-1)
 (isAdjacent pos0-3 pos1-3)
 (isAdjacent pos0-3 pos0-4)
 (isAdjacent pos0-3 pos0-2)
 (isAdjacent pos0-4 pos1-4)
 (isAdjacent pos0-4 pos0-3)
 (isAdjacent pos1-0 pos2-0)
 (isAdjacent pos1-0 pos1-1)
 (isAdjacent pos1-0 pos0-0)
 (isAdjacent pos1-1 pos2-1)
 (isAdjacent pos1-1 pos1-2)
 (isAdjacent pos1-1 pos0-1)
 (isAdjacent pos1-1 pos1-0)
 (isAdjacent pos1-2 pos2-2)
 (isAdjacent pos1-2 pos1-3)
 (isAdjacent pos1-2 pos0-2)
 (isAdjacent pos1-2 pos1-1)
 (isAdjacent pos1-3 pos2-3)
 (isAdjacent pos1-3 pos1-4)
 (isAdjacent pos1-3 pos0-3)
 (isAdjacent pos1-3 pos1-2)
 (isAdjacent pos1-4 pos2-4)
 (isAdjacent pos1-4 pos0-4)
 (isAdjacent pos1-4 pos1-3)
 (isAdjacent pos2-0 pos2-1)
 (isAdjacent pos2-0 pos1-0)
 (isAdjacent pos2-1 pos2-2)
 (isAdjacent pos2-1 pos1-1)
 (isAdjacent pos2-1 pos2-0)
 (isAdjacent pos2-2 pos2-3)
 (isAdjacent pos2-2 pos1-2)
 (isAdjacent pos2-2 pos2-1)
 (isAdjacent pos2-3 pos2-4)
 (isAdjacent pos2-3 pos1-3)
 (isAdjacent pos2-3 pos2-2)
 (isAdjacent pos2-4 pos1-4)
 (isAdjacent pos2-4 pos2-3)
    (tailSnake pos0-3)
    (headSnake pos0-2)
    (nextSnake pos0-2 pos0-3)
    (blocked pos0-2)
 (blocked pos0-3)
    (spawn pos1-2)
 (nextSpawn pos1-1 dummyPoint)
 (nextSpawn pos1-2 pos1-1)
    (isPoint pos0-4)
 (isPoint pos2-4)
 (isPoint pos1-3)
 (isPoint pos0-1)
 (isPoint pos1-4)
)
(:goal (and
    (not (isPoint pos0-4))
 (not (isPoint pos2-4))
 (not (isPoint pos1-3))
 (not (isPoint pos0-1))
 (not (isPoint pos1-4))
 (not (isPoint pos1-2))
 (not (isPoint pos1-1))
))
)

; plan
1. (move pos0-2 pos1-2 pos0-3 pos0-2)
   deleted: (headsnake pos0-2) (blocked pos0-3) (tailsnake pos0-3) (nextsnake pos0-2 pos0-3)
   added: (blocked pos1-2) (headsnake pos1-2) (nextsnake pos1-2 pos0-2) (tailsnake pos0-2)
   goals met: 2 of 7
2. (move-and-eat-spawn pos1-2 pos1-3 pos1-2 pos1-1)
   deleted: (headsnake pos1-2) (ispoint pos1-3) (spawn pos1-2)
   added: (blocked pos1-3) (headsnake pos1-3) (nextsnake pos1-3 pos1-2) (ispoint pos1-2) (spawn pos1-1)
   goals met: 2 of 7
3. (move pos1-3 pos2-3 pos0-2 pos1-2)
   deleted: (headsnake pos1-3) (blocked pos0-2) (tailsnake pos0-2) (nextsnake pos1-2 pos0-2)
   added: (blocked pos2-3) (headsnake pos2-3) (nextsnake pos2-3 pos1-3) (tailsnake pos1-2)
   goals met: 2 of 7
4. (move-and-eat-spawn pos2-3 pos2-4 pos1-1 dummypoint)
   deleted: (headsnake pos2-3) (ispoint pos2-4) (spawn pos1-1)
   added: (blocked pos2-4) (headsnake pos2-4) (nextsnake pos2-4 pos2-3) (ispoint pos1-1) (spawn dummypoint)
   goals met: 2 of 7
5. (move-and-eat-no-spawn pos2-4 pos1-4)
   deleted: (headsnake pos2-4) (ispoint pos1-4)
   added: (blocked pos1-4) (headsnake pos1-4) (nextsnake pos1-4 pos2-4)
   goals met: 3 of 7
6. (move-and-eat-no-spawn pos1-4 pos0-4)
   deleted: (headsnake pos1-4) (ispoint pos0-4)
   added: (blocked pos0-4) (headsnake pos0-4) (nextsnake pos0-4 pos1-4)
   goals met: 4 of 7
7. (move pos0-4 pos0-3 pos1-2 pos1-3)
   deleted: (headsnake pos0-4) (blocked pos1-2) (tailsnake pos1-2) (nextsnake pos1-3 pos1-2)
   added: (blocked pos0-3) (headsnake pos0-3) (nextsnake pos0-3 pos0-4) (tailsnake pos1-3)
   goals met: 4 of 7
8. (move pos0-3 pos0-2 pos1-3 pos2-3)
   deleted: (headsnake pos0-3) (blocked pos1-3) (tailsnake pos1-3) (nextsnake pos2-3 pos1-3)
   added: (blocked pos0-2) (headsnake pos0-2) (nextsnake pos0-2 pos0-3) (tailsnake pos2-3)
   goals met: 4 of 7
9. (move-and-eat-no-spawn pos0-2 pos1-2)
   deleted: (headsnake pos0-2) (ispoint pos1-2)
   added: (blocked pos1-2) (headsnake pos1-2) (nextsnake pos1-2 pos0-2)
   goals met: 5 of 7
10. (move-and-eat-no-spawn pos1-2 pos1-1)
   deleted: (headsnake pos1-2) (ispoint pos1-1)
   added: (blocked pos1-1) (headsnake pos1-1) (nextsnake pos1-1 pos1-2)
   goals met: 6 of 7
11. (move-and-eat-no-spawn pos1-1 pos0-1)
   deleted: (headsnake pos1-1) (ispoint pos0-1)
   added: (blocked pos0-1) (headsnake pos0-1) (nextsnake pos0-1 pos1-1)
   goals met: 7 of 7
